In [152]:
import pandas as pd
import matplotlib.pyplot as plt
import random
import numpy as np

In [153]:
df1 = pd.read_csv("../dutch-energy/Electricity/liander_electricity_01012010.csv")
df1['year'] = '2010'
df2 = pd.read_csv("../dutch-energy/Electricity/liander_electricity_01012012.csv")
df2['year'] = '2012'
df3 = pd.read_csv("../dutch-energy/Electricity/liander_electricity_01012015.csv")
df3['year'] = '2015'
df4 = pd.read_csv("../dutch-energy/Electricity/liander_electricity_01012018.csv")
df4['year'] = '2018'
df = pd.concat([df1,df2,df3,df4])

In [154]:
Ten = df.loc[(df['city']=='AMSTERDAM')&(df['year']=='2010'),'annual_consume']
Twelve = df.loc[(df['city']=='AMSTERDAM')&(df['year']=='2012'),'annual_consume']
Fifteen = df.loc[(df['city']=='AMSTERDAM')&(df['year']=='2015'), 'annual_consume']
Eighteen = df.loc[(df['city']=='AMSTERDAM')&(df['year']=='2018'), 'annual_consume']

Ten = Ten.reset_index(drop=True)
Twelve = Twelve.reset_index(drop=True)
Fifteen = Fifteen.reset_index(drop=True)
Eighteen = Eighteen.reset_index(drop=True)

In [155]:
Twelve.describe()

count    15218.000000
mean      3576.168419
std       3257.850965
min        340.000000
25%       2000.000000
50%       2591.500000
75%       3807.000000
max      52787.000000
Name: annual_consume, dtype: float64

In [156]:
First = pd.DataFrame()
for n in range(3000):
    i = random.randint(1, 15000)
    diff = pd.DataFrame({'delta':Eighteen[i] - Ten[i]}, index=[i])
    First = pd.concat([First, diff])    
Second = pd.DataFrame()
for n in range(3000):
    i = random.randint(0, 15000)
    diff = pd.DataFrame({'delta':Twelve[i] - Ten[i]}, index=[i])
    Second = pd.concat([Second, diff])
Third = pd.DataFrame()
for n in range(3000):
    i = random.randint(0, 15000)
    diff = pd.DataFrame({'delta':Fifteen[i] - Twelve[i]}, index=[i])
    Third = pd.concat([Third, diff])  
Fourth = pd.DataFrame()
for n in range(3000):
    i = random.randint(0, 15000)
    diff = pd.DataFrame({'delta':Eighteen[i] - Fifteen[i]}, index=[i])
    Fourth = pd.concat([Third, diff])

In [157]:
First = First.reset_index()
First = First.rename(index=str, columns={"index": "original_index"})
First['period'] = 1
First['city'] = 'AMSTERDAM'
Second = Second.reset_index()
Second = Second.rename(index=str, columns={"index": "original_index"})
Second['period'] = 2
Second['city'] = 'AMSTERDAM'
Third = Third.reset_index()
Third = Third.rename(index=str, columns={"index": "original_index"})
Third['period'] = 3
Third['city'] = 'AMSTERDAM'
Fourth = Fourth.reset_index()
Fourth = Fourth.rename(index=str, columns={"index": "original_index"})
Fourth['period'] = 4
Fourth['city'] = 'AMSTERDAM'
Liander1 = pd.concat([First,Second,Third, Fourth])

In [158]:
Liander1.head()

   original_index  delta  period       city
0            3443  -2415       1  AMSTERDAM
1           12321   1109       1  AMSTERDAM
2           13961    -39       1  AMSTERDAM
3            7199   2966       1  AMSTERDAM
4            5792  -1529       1  AMSTERDAM

In [159]:
df1 = pd.read_csv("../dutch-energy/Electricity/liander_electricity_01012010.csv")
df1['year'] = '2010'
df2 = pd.read_csv("../dutch-energy/Electricity/liander_electricity_01012012.csv")
df2['year'] = '2012'
df3 = pd.read_csv("../dutch-energy/Electricity/liander_electricity_01012015.csv")
df3['year'] = '2015'
df4 = pd.read_csv("../dutch-energy/Electricity/liander_electricity_01012018.csv")
df4['year'] = '2018'
df = pd.concat([df1,df2,df3,df4])

In [160]:
Ten = df.loc[(df['city']=='ALMERE')&(df['year']=='2010'),'annual_consume']
Twelve = df.loc[(df['city']=='ALMERE')&(df['year']=='2012'),'annual_consume']
Fifteen = df.loc[(df['city']=='ALMERE')&(df['year']=='2015'), 'annual_consume']
Eighteen = df.loc[(df['city']=='ALMERE')&(df['year']=='2018'), 'annual_consume']

Ten = Ten.reset_index(drop=True)
Twelve = Twelve.reset_index(drop=True)
Fifteen = Fifteen.reset_index(drop=True)
Eighteen = Eighteen.reset_index(drop=True)

In [161]:
Eighteen.describe()

count     4339.000000
mean      4018.480525
std       2742.307980
min       1117.000000
25%       2817.000000
50%       3436.000000
75%       4149.000000
max      41785.000000
Name: annual_consume, dtype: float64

In [162]:
First = pd.DataFrame()
for n in range(3000):
    i = random.randint(1, 4000)
    diff = pd.DataFrame({'delta':Eighteen[i] - Ten[i]}, index=[i])
    First = pd.concat([First, diff])    
Second = pd.DataFrame()
for n in range(3000):
    i = random.randint(0, 4000)
    diff = pd.DataFrame({'delta':Twelve[i] - Ten[i]}, index=[i])
    Second = pd.concat([Second, diff])
Third = pd.DataFrame()
for n in range(3000):
    i = random.randint(0, 4000)
    diff = pd.DataFrame({'delta':Fifteen[i] - Twelve[i]}, index=[i])
    Third = pd.concat([Third, diff])  
Fourth = pd.DataFrame()
for n in range(3000):
    i = random.randint(0, 4000)
    diff = pd.DataFrame({'delta':Eighteen[i] - Fifteen[i]}, index=[i])
    Fourth = pd.concat([Third, diff])

In [163]:
First = First.reset_index()
First = First.rename(index=str, columns={"index": "original_index"})
First['period'] = 1
First['city'] = 'ALMERE'
Second = Second.reset_index()
Second = Second.rename(index=str, columns={"index": "original_index"})
Second['period'] = 2
Second['city'] = 'ALMERE'
Third = Third.reset_index()
Third = Third.rename(index=str, columns={"index": "original_index"})
Third['period'] = 3
Third['city'] = 'ALMERE'
Fourth = Fourth.reset_index()
Fourth = Fourth.rename(index=str, columns={"index": "original_index"})
Fourth['period'] = 4
Fourth['city'] = 'ALMERE'
Liander2 = pd.concat([First,Second,Third, Fourth])

In [164]:
Liander = pd.concat([Liander1, Liander2])

In [165]:
Liander.describe()

       original_index         delta        period
count    24002.000000  24002.000000  24002.000000
mean      4778.172361   -212.223148      2.500125
std       4230.031348   3927.344049      1.118095
min          0.000000 -51648.000000      1.000000
25%       1551.250000  -1246.000000      2.000000
50%       3156.000000   -165.000000      3.000000
75%       7648.000000    838.000000      4.000000
max      15000.000000  35917.000000      4.000000

In [166]:
Liander

      original_index  delta  period       city
0               3443  -2415       1  AMSTERDAM
1              12321   1109       1  AMSTERDAM
2              13961    -39       1  AMSTERDAM
3               7199   2966       1  AMSTERDAM
4               5792  -1529       1  AMSTERDAM
5              13204  -1892       1  AMSTERDAM
6               6454    526       1  AMSTERDAM
7               9786   -342       1  AMSTERDAM
8               3397 -17869       1  AMSTERDAM
9               7174   -545       1  AMSTERDAM
10              2181 -10513       1  AMSTERDAM
11              2106  -3792       1  AMSTERDAM
12              5694   -776       1  AMSTERDAM
13              7460  -1620       1  AMSTERDAM
14              7386  -3280       1  AMSTERDAM
15             11539    -92       1  AMSTERDAM
16              5556   1523       1  AMSTERDAM
17                90  -4467       1  AMSTERDAM
18              1268    923       1  AMSTERDAM
19              1463  -1160       1  AMSTERDAM
20              1475   1881       1  AMSTERDAM
21             12959   3763       1  AMSTERDAM
22              6166    122       1  AMSTERDAM
23             12932   2098       1  AMSTERDAM
24             11934   2525       1  AMSTERDAM
25              7996   -628       1  AMSTERDAM
26              6872    599       1  AMSTERDAM
27                97  -1964       1  AMSTERDAM
28               519  11799       1  AMSTERDAM
29              4026  -3059       1  AMSTERDAM
...              ...    ...     ...        ...
2971            1522  -3074       4     ALMERE
2972            1582    441       4     ALMERE
2973             337  -4845       4     ALMERE
2974            1205   -133       4     ALMERE
2975            3128  -1323       4     ALMERE
2976            2651    179       4     ALMERE
2977            3448   -504       4     ALMERE
2978            3856     43       4     ALMERE
2979            2585 -34126       4     ALMERE
2980             322  -1109       4     ALMERE
2981            2833   1328       4     ALMERE
2982             388   -214       4     ALMERE
2983             804  -1917       4     ALMERE
2984             293   -110       4     ALMERE
2985            1634   1097       4     ALMERE
2986            1438    647       4     ALMERE
2987             344  -7880       4     ALMERE
2988             810   1026       4     ALMERE
2989             129  -1847       4     ALMERE
2990            1076  -1200       4     ALMERE
2991             637    571       4     ALMERE
2992            3511  -1293       4     ALMERE
2993            1834   -965       4     ALMERE
2994            3940  -1573       4     ALMERE
2995            2491  -2039       4     ALMERE
2996             182  -1246       4     ALMERE
2997             322  -1109       4     ALMERE
2998            3943   -295       4     ALMERE
2999            1772   1977       4     ALMERE
3000            1178   -379       4     ALMERE

[24002 rows x 4 columns]

In [167]:
Liander.to_csv('../LianderEnergy.csv', encoding='utf-8', index=False)

In [168]:
Liander.describe()

       original_index         delta        period
count    24002.000000  24002.000000  24002.000000
mean      4778.172361   -212.223148      2.500125
std       4230.031348   3927.344049      1.118095
min          0.000000 -51648.000000      1.000000
25%       1551.250000  -1246.000000      2.000000
50%       3156.000000   -165.000000      3.000000
75%       7648.000000    838.000000      4.000000
max      15000.000000  35917.000000      4.000000